import { Fragment, useState } from "react";
import AccordionList from '../../../UI/AccordionList';
import CarouselBootstrap from '../../../UI/CarouselBootstrap';
import Chip from '../../../UI/Chip';
import CustomizedTimeLine from '../../../UI/CustomizedTimeLine';
import Gallery from '../../../UI/Gallery';
import ModalBootstrap from '../../../UI/ModalBootstrap';
import image from "../../../../images/flag-uk.png";
import Image from '../../../UI/Image/Image';
import classes from './PostContent.module.scss';
import LefletMap from "../../../UI/LefletMap";

const PostContent = props => {
    const [showModal, setShowModal] = useState(false);
    const [imageIndex, setImageIndex] = useState(0);
    const images = [
        {
            src: "https://muzeibotev.com/clients/152/files/images/65.jpg",
            title: `жовник и обществен деец, който учи в Одеса, съставя и превежда учебници, а майка му е от скромно калоферско семейство.[4] Освен Христо Ботев, двамата имат още осем деца: Ана (1850 – 1867), Петко (1852 – 1872), Стефан (1854 – 1890), Кирил (1856 – 1944), Тота (1859 – 1864), Генко (1861 – 1863), Генко (1863 – 1866) и Боян (1866 – 1885).[5]
        Националният музей „Христо Ботев“ в Калофер Според някои източници Христо Ботев е роден в стая на калоферското училище, в която живеят родителите му. Малко по-късно в Калофер е построено ново училище и семейството наема къща на Генко Филов, в която Ботев прекарва първите няколко години от живота си. Тази къща е унищожена по време на Руско-турската война, но през 1940-те години е възстановена и превърната в Национален музей „Христо Ботев“.[6]
        През 1854 година Ботьо Петков не успява да се споразумее с калоферската община за заплащането си и се премества в Карлово. Там семейството живее в къщата на майка му в Табашката махала, а Христо Ботев тръгва на училище, като негов учител е баща му. През 1858 година Ботьо Петков обвинява управата на карловската община, че се опитва да си присвои пари, завещани за училището, след което се връща в Калофер. Общината се опитва неуспешно да го настани в къща на живеещия в Цариград търговец Христо Тъпчилещов, след което семейството се настанява в къща на хаджи Нестор. След връщането им в Калофер Христо Ботев постъпва в местното трикласно училище, където учител е баща му.[7]
        В Одеса и връщане в Калофер Датите са по Юлианския календар (стар стил), о`,
        },
        {
            src: "https://images.unsplash.com/photo-1552288092-76e7d732366c?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxzZWFyY2h8Mnx8cGFub3JhbWljfGVufDB8fDB8fA%3D%3D&w=1000&q=80",
            title: "Никола Войновски",
        },
        {
            src: "https://muzeibotev.com/clients/152/files/images/65.jpg",
            title: "Никола Обретанов",
        },
        {
            src: "https://muzeibotev.com/clients/152/files/images/73.jpg",
            title: "Никола Войновски",
        },
        {
            src: "https://muzeibotev.com/clients/152/files/images/65.jpg",
            title: "Никола Обретанов",
        },
        {
            src: "https://muzeibotev.com/clients/152/files/images/73.jpg",
            title: "Никола Войновски",
        },
    ];

    const text = `Роден е на 6 януари 1848 година (25 декември 1847 година стар стил) в Калофер, в семейството на даскал Ботьо Петков (1815 – 1869) и Иванка Ботева (1823 – 1911).[2] Съществуват и други хипотези за родното му място, които днес се отхвърлят от изследователите – че той е „из Карлово“, както пише в едно официално писмо на Найден Геров, или че е роден в село Осен, както споменава самият Ботев в статията си „Примери от турското правосъдие“.[3]
      ИЗОБРАЖЕНИЕ 1
      Бащата на Ботев Ботьо Петков е учител, книжовник и обществен деец, който учи в Одеса, съставя и превежда учебници, а майка му е от скромно калоферско семейство.[4] Освен Христо Ботев, двамата имат още осем деца: Ана (1850 – 1867), Петко (1852 – 1872), Стефан (1854 – 1890), Кирил (1856 – 1944), Тота (1859 – 1864), Генко (1861 – 1863), Генко (1863 – 1866) и Боян (1866 – 1885).[5]
      Националният музей „Христо Ботев“ в Калофер Според някои източници Христо Ботев е роден в стая на калоферското училище, в която живеят родителите му. Малко по-късно в Калофер е построено ново училище и семейството наема къща на Генко Филов, в която Ботев прекарва първите няколко години от живота си. Тази къща е унищожена по време на Руско-турската война, но през 1940-те години е възстановена и превърната в Национален музей „Христо Ботев“.[6]
      През 1854 година Ботьо Петков не успява да се споразумее с калоферската община за заплащането си и се премества в Карлово. Там семейството живее в къщата на майка му в Табашката махала, а Христо Ботев тръгва на училище, като негов учител е баща му. През 1858 година Ботьо Петков обвинява управата на карловската община, че се опитва да си присвои пари, завещани за училището, след което се връща в Калофер. Общината се опитва неуспешно да го настани в къща на живеещия в Цариград търговец Христо Тъпчилещов, след което семейството се настанява в къща на хаджи Нестор. След връщането им в Калофер Христо Ботев постъпва в местното трикласно училище, където учител е баща му.[7]
      ИЗОБРАЖЕНИЕ 2
      В Одеса и връщане в Калофер Датите са по Юлианския календар (стар стил), освен ако не е указано иначе.
      Още от 1857 година Ботьо Петков се опитва да изпрати сина си да учи в Русия с помощта на Найден Геров, негов познат от Одеса, който е станал известен просветен деец и руски вицеконсул в Пловдив. Това се осъществява едва през есента на 1863 година, когато Христо Ботев получава стипендия от руското правителство и заминава през Пловдив и Цариград за Одеса, където пристига на 14 ноември.[8]
      В Одеса Христо Ботев се свързва с Одеско българско настоятелство, до което има препоръчително писмо от Найден Геров, и неговия член Никола Тошков, заможен търговец, роден в Калофер и познат на баща му. Той постъпва във Втора гимназия като „волнослушател“, тъй като не е достатъчно добре подготвен за редовен ученик, и се настанява в нейния пансион, където по това време живеят още десетина български ученици.[9]
      Още с постъпването си в гимназията Ботев трудно се вписва в учебната дейност – той непрекъснато се оплаква от строгата дисциплина, налагането на която включва и физически наказания, но в същото време често отсъства от занятия, участва в сбивания със съученици и се отнася високомерно към повечето си учители. През 1864 година той напуска училищния пансион и започва да живее самостоятелно в различни квартири. Въпреки настоятелните писма на баща му и опитите на Никола Тошков да му повлияе, той занемарява училището и с ексцентричното си поведение отблъсква българската общност в Одеса, като мнозина нейни представители ограничават контактите си с него.[10]
      Макар че не посещава често училището, Ботев прекарва дълго време в различни библиотеки, най-вече в Българската библиотека „Юрий Венелин“, която се помещава в дома на Тошков. Чете главно руски автори, като е особено впечатлен от Николай Чернишевски и Иван Тургенев. Запознава се с филолога Виктор Григорович, на когото помага с руски преводи на български народни песни. Според неговия съученик Киро Тулешков, още през лятото на 1864 година Ботев работи върху своето стихотворение „Майце си“, консултирайки се с Григорович, и дори по това време го изпраща на Петко Славейков в Цариград. Достоверността на това сведение не е изяснена, тъй като стихотворението е публикувано от Славейков едва няколко години по-късно.[11]`;

    const onImageClick = (index) => {
        console.log(index);
        setImageIndex(index);
        setShowModal(true);
    };

    const dummyColumns = [
        {
            id: 'title',
            headerText: 'Заглавие',
            sortable: true
        }
        // {
        //   id: "name",
        //   headerText: "Име",
        //   sortable: true,
        //   numeric: false,
        //   avatar: true,
        //   classesOuter: `${classes["name-cell"]}`,
        //   classesInner: `${classes["header__text--name-title"]}`,
        // },
        // {
        //   id: "years",
        //   headerText: "Години",
        //   headerTextSubtitle: "(Kъм 1876 г.)",
        //   sortable: true,
        //   numeric: true,
        //   classesOuter: `${classes["years-cell"]}`,
        //   classesInner: `${classes["header__text--years-old-title"]}`,
        // },
        // {
        //   id: "born",
        //   headerText: "Роден",
        //   objectType: true,
        //   classesOuter: `${classes["responsive-cell"]}`,
        //   classesRowInner: classes['row-inner']
        // },
        // {
        //   id: "died",
        //   headerText: "Починал",
        //   objectType: true,
        //   classesOuter: `${classes["responsive-cell"]}`,
        //   classesRowInner: classes['row-inner']
        // },
    ];

    const dummyData = [
        {
            title: "Майце си",
            years: 28,
            content:
                "Роден е на 6 януари 1848 година (25 декември 1847 година стар стил) в Калофер, в семейството на даскал Ботьо Петков (1815 – 1869) и Иванка Ботева (1823 – 1911).[2] Съществуват и други хипотези за родното му място, които днес се отхвърлят от изследователите – че той е „из Карлово“, както пише в едно официално писмо на Найден Геров, или че е роден в село Осен, както споменава самият Ботев в статията си „Примери от турското правосъдие“.[3]",
            born: { date: "6 януари 1948 г.", place: "Калофер" },
            died: { date: "6 януари 1948 г.", place: "Калофер" },
        },
        {
            title: "На прощаване",
            years: 32,
            content:
                `Не плачи, майко, не тъжи,
  
          че станах ази хайдутин,
          
          хайдутин, майко, бунтовник,
          
          та тебе клета оставих
          
          за първо чедо да жалиш!
          
          Но кълни, майко, проклинай
          
          таз турска черна прокуда,
          
          дето нас млади пропъди
          
          по тази тежка чужбина —
          
          да ходим да се скитаме
          
          немили, клети, недраги!
          
          Аз зная, майко, мил съм ти,
          
          че може млад да загина,
          
          ах, утре като премина
          
          през тиха бяла Дунава!
          
          Но кажи какво да правя,
          
          кат ме си, майко, родила
          
          със сърце мъжко, юнашко,
          
          та сърце, майко, не трае
          
          да гледа турчин, че бесней
          
          над бащино ми огнище:
          
          там, дето аз съм пораснал
          
          и първо мляко засукал,
          
          там, дето либе хубаво
          
          черни си очи вдигнеше
          
          и с оназ тиха усмивка
          
          в скръбно ги сърце впиеше,
          
          там, дето баща и братя
          
          черни чернеят за мене!…
          
          Ах, мале — майко юнашка!
          
          Прости ме и веч прощавай!
          
          Аз вече пушка нарамих
          
          и на глас тичам народен
          
          срещу врагът си безверни.
          
          Там аз за мило, за драго,
          
          за теб, за баща, за братя,
          
          за него ще се заловя,
          
          пък… каквото сабя покаже
          
          и честта, майко, юнашка!
          
          А ти ’га чуеш, майнольо,
          
          че куршум пропей над село
          
          и момци вече наскачат,
          
          ти излез, майко — питай ги,
          
          де ти е чедо остало?
          
          Ако ти кажат, че азе
          
          паднал съм с куршум пронизан,
          
          и тогаз, майко, не плачи,
          
          нито пък слушай хората,
          
          дето ще кажат за мене
          
          „Нехранимайка излезе“,
          
          но иди, майко, у дома
          
          и с сърце сичко разкажи
          
          на мойте братя невръстни,
          
          да помнят и те да знаят,
          
          че и те брат са имали,
          
          но брат им падна, загина,
          
          затуй, че клетник не трая
          
          пред турци глава да скланя,
          
          сюрмашко тегло да гледа!
          
          Кажи им, майко, да помнят,
          
          да помнят, мене да търсят:
          
          бяло ми месо по скали,
          
          по скали и по орляци,
          
          черни ми кърви в земята,
          
          в земята, майко, черната!
          
          Дано ми найдат пушката,
          
          пушката, майко, сабята,
          
          и дето срещнат душманин,
          
          със куршум да го поздравят,
          
          а пък със сабя помилват…
          
          Ако ли, майко, не можеш
          
          от милост и туй да сториш,
          
          то ’га се сберат момите
          
          пред назе, майко, на хоро
          
          и дойдат мойте връстници
          
          и скръбно либе с другарки,
          
          ти излез, майко, послушай
          
          със мойте братя невръстни
          
          моята песен юнашка —
          
          защо и как съм загинал
          
          и какви думи издумал
          
          пред смъртта и пред дружина…
          
          Тъжно щеш, майко, да гледаш
          
          ти на туй хоро весело,
          
          и като срещнеш погледът
          
          на мойто либе хубаво,
          
          дълбоко ще ми въздъхнат
          
          две сърца мили за мене —
          
          нейното, майко, и твойто!
          
          И две щат сълзи да капнат
          
          на стари гърди и млади…
          
          Но туй щаг братя да видят
          
          и кога, майко, пораснат,
          
          като брата си ще станат —
          
          силно да любят и мразят…
          
          Ако ли, мале, майноле,
          
          жив и здрав стигна до село,
          
          жив и здрав с байряк във ръка,
          
          под байряк лични юнаци,
          
          напети в дрехи войнишки,
          
          с левове златни на чело,
          
          с игляни пушки[1] на рамо
          
          и с саби-змии на кръстът,
          
          о, тогаз, майко юнашка!
          
          О, либе мило, хубаво!
          
          Берете цветя в градина,
          
          късайте бръшлян и здравец,
          
          плетете венци и китки
          
          да кичим глави и пушки!
          
          И тогаз с венец и китка
          
          ти, майко, ела при мене,
          
          ела ме, майко, прегърни
          
          и в красно чело целуни —
          
          красно, с две думи заветни:
          
          свобода и смърт юнашка!
          
          А аз ще либе прегърна
          
          с кървава ръка през рамо,
          
          да чуй то сърце юнашко,
          
          как тупа сърце, играе;
          
          плачът му да спра с целувка,
          
          сълзи му с уста да глътна…
          
          Пък тогаз… майко, прощавай!
          
          Ти, либе, не ме забравяй!
          
          Дружина тръгва, отива,
          
          пътят е страшен, но славен:
          
          аз може млад да загина…
          
          Но… стига ми тая награда —
          
          да каже нявга народът:
          
          умря сиромах за правда,
          
          за правда и за свобода…`,
            born: { date: "6 януари 1948 г.", place: "Калофер" },
            died: { date: "6 януари 1948 г.", place: "Калофер" },
        },
    ];
    return (
        <Fragment>
            <h2 className={classes.heading}>
                Изложба за Христо Ботев по случай 175-годишнината от рождението му
            </h2>
            <div className={classes.chips}>
                <Chip iconLeft="author">Виктор Комбов</Chip>
                <Chip iconLeft="timePosted">12 юни 2022 г., 01:09 ч.</Chip>
                <Chip iconLeft="visited">32112</Chip>
            </div>
            <div className={classes["post-content"]}>
                {/* <MasterDetailTable originalRows={dummyData} columns={dummyColumns}><DetailText /></MasterDetailTable> */}
                <AccordionList />
                <CustomizedTimeLine />
                <div style={{width: '100%', height: '600px'}}>
                    <LefletMap />
                </div>
                {text.split("\n").map((paragraph, i) => {
                    return (
                        <Fragment key={i}>
                            {paragraph.includes('ИЗОБРАЖЕНИЕ') ? images.length && (
                                <Fragment>
                                    <Image
                                        type="post"
                                        rec={images[+paragraph.match(/\d+/)[0] - 1]}
                                        onImageClick={() => onImageClick(+paragraph.match(/\d+/)[0] - 1)}
                                    />
                                    <div className={classes["image-title"]}>
                                        {images[+paragraph.match(/\d+/)[0] - 1].title.length > 100
                                            ? images[+paragraph.match(/\d+/)[0] - 1].title.substring(0, 100) + '...'
                                            : images[+paragraph.match(/\d+/)[0] - 1].title}
                                    </div>
                                </Fragment>
                            ) : <p>{paragraph}</p>}
                        </Fragment>
                    );
                })}

                <Gallery images={images} onImageClick={onImageClick} />
                <ModalBootstrap show={showModal} close={() => setShowModal(false)}>
                    <CarouselBootstrap
                        items={images}
                        index={imageIndex}
                        type="gallery"
                    ></CarouselBootstrap>
                </ModalBootstrap>
            </div>
        </Fragment>
    );
}

export default PostContent;